[
  {
    "id": 1,
    "title": "Dental Management System",
    "description": "Sistema completo de gestión para clínicas odontológicas que digitalizó el 100% de historiales médicos, redujo 40% el tiempo de agendamiento y optimizó el control de inventario. Desarrollé tanto el frontend en React como el backend en Spring Boot para crear una solución integral y robusta.",
    "imageUrl": "/images/project-task-app.png",
    "technologies": ["Java", "Javascript", "Junit", "JWT", "React", "SpringBoot", "MySQL", "Git", "Tailwind", "Axios", "Vite", "Node"],
    "myRole": "Full Stack Developer",
    "teamSize": "3 desarrolladores",
    "duration": "4 meses",
    "myContribution": [
      "Desarrollo completo del frontend en React con Tailwind CSS",
      "Implementación de interfaz responsive y componentes reutilizables",
      "Desarrollo de APIs REST con Java Spring Boot",
      "Diseño e implementación de base de datos MySQL",
      "Integración completa frontend-backend con manejo de estados",
      "Testing tanto en frontend como backend (JUnit y pruebas de integración)"
    ],
    "challenges": "Integración compleja entre múltiples módulos (historiales, inventario, citas) y optimización de rendimiento para manejo de grandes volúmenes de datos médicos",
    "results": [
      "100% digitalización de historiales médicos",
      "40% reducción en tiempo de agendamiento de citas",
      "Interface intuitiva que mejoró 98% la satisfacción de usuarios",
      "API robusta con 99.8% de disponibilidad y respuesta <150ms"
    ],
    "projectType": "Universitario - Colaborativo",
    "githubUrl": "https://github.com/CamiloCuenca/dental-management-system-backend.git",
    "frontendUrl": "https://github.com/CamiloCuenca/dental-management-system-frontend.git",
    "liveUrl": "https://dental-management-system-frontend.vercel.app/"
  },
  {
    "id": 2,
    "title": "UniEventos",
    "description": "Plataforma completa de venta de entradas para eventos que revoluciona la experiencia de compra de boletos. Desarrollé tanto el frontend en Angular como las APIs backend en Spring Boot, incluyendo sistema de autenticación seguro, gestión de eventos, procesamiento de pagos y panel administrativo.",
    "imageUrl": "/images/project-ecommerce.jpg",
    "technologies": ["Angular", "SpringBoot", "Node", "Java", "MongoDB", "Css", "JWT", "Git", "Junit", "Postman"],
    "myRole": "Full Stack Developer",
    "teamSize": "3 desarrolladores",
    "duration": "4 meses",
    "myContribution": [
      "Desarrollo completo del frontend en Angular con TypeScript",
      "Desarrollo de APIs REST con Java Spring Boot",
      "Implementación de sistema de autenticación JWT en ambos extremos",
      "Diseño y desarrollo de interfaces de usuario responsive",
      "Integración completa con base de datos MongoDB",
      "Implementación de sistema de pagos tanto frontend como backend",
      "Testing integral de la aplicación completa"
    ],
    "challenges": "Implementación de sistema de pagos seguro, manejo de concurrencia para venta de boletos limitados, y optimización de rendimiento para picos de tráfico",
    "results": [
      "Sistema de pagos 100% funcional y seguro (frontend + backend)",
      "Interfaz intuitiva que redujo 60% el tiempo de compra",
      "Arquitectura escalable para eventos masivos",
      "API robusta capaz de manejar 1000+ usuarios concurrentes"
    ],
    "projectType": "Universitario - Colaborativo",
    "githubUrl": "https://github.com/CamiloCuenca/UniEventos_proyecto_final_Backend.git",
    "frontendUrl": "https://github.com/CamiloCuenca/UniEventos_proyecto_final_Frontend.git",
    "liveUrl": "https://app-frontend-unieventos-d7166.web.app/"
  },
  {
    "id": 3,
    "title": "Exami",
    "description": "Sistema integral de gestión de exámenes académicos que optimiza los procesos de evaluación educativa. Desarrollé la solución completa: frontend en React para una interfaz intuitiva y backend robusto en Spring Boot con Oracle, incluyendo creación dinámica de exámenes, banco de preguntas categorizado, sistema de calificaciones automatizado y analíticas de rendimiento estudiantil.",
    "imageUrl": "/images/project-blog.webp",
    "technologies": ["Node", "React", "Oracle", "Git", "Axios", "Vite", "Java", "SpringBoot", "Junit", "Tailwind"],
    "myRole": "Full Stack Developer",
    "teamSize": "3 desarrolladores", 
    "duration": "4 meses",
    "myContribution": [
      "Desarrollo completo de la API REST con Spring Boot",
      "Desarrollo del frontend en React con interfaz intuitiva",
      "Diseño e implementación completa de base de datos Oracle",
      "Sistema de autenticación y autorización JWT fullstack",
      "Lógica de negocio para generación automática de exámenes",
      "Integración completa frontend-backend con gestión de estados",
      "Testing unitario e integración en ambas capas (JUnit y React Testing)"
    ],
    "challenges": "Implementación de algoritmos para generación aleatoria de exámenes balanceados, integración compleja frontend-backend para tiempo real, optimización de consultas complejas en Oracle, y desarrollo de interfaz intuitiva para múltiples tipos de usuarios",
    "results": [
      "95% reducción en tiempo de creación de exámenes",
      "Sistema de roles que gestiona 5 tipos de usuarios diferentes", 
      "Base de datos optimizada para manejar +10,000 preguntas",
      "API con 99.9% de disponibilidad y respuesta <200ms"
    ],
    "projectType": "Universitario - Colaborativo",
    "githubUrl": "https://github.com/CamiloCuenca/Exami.git",
    "frontendUrl": "https://github.com/CamiloCuenca/exami-front.git"
  },
  {
    "id": 4,
    "title": "Analizador Léxico para TypeScript",
    "description": "Analizador léxico completo desarrollado en Python para procesar código fuente TypeScript y descomponerlo en tokens. Incluye interfaz gráfica intuitiva con PyQt5 para visualización interactiva del proceso de tokenización. Herramienta educativa ideal para el estudio de compiladores y análisis sintáctico.",
    "imageUrl": "/images/project-ecommerce.jpg",
    "technologies": ["Python", "Tkinter", "Pytest"],
    "myRole": "Desarrollador Principal",
    "teamSize": "1 desarrollador (proyecto personal)",
    "duration": "1 meses",
    "myContribution": [
      "Diseño e implementación completa del algoritmo de análisis léxico",
      "Desarrollo de interfaz gráfica con Tkinter para visualización",
      "Implementación de reconocimiento de tokens TypeScript",
      "Testing exhaustivo con Pytest",
      "Documentación técnica completa"
    ],
    "challenges": "Implementación de algoritmos de reconocimiento de patrones complejos, manejo eficiente de archivos grandes de código, y creación de interfaz intuitiva para visualización de tokens",
    "results": [
      "100% precisión en reconocimiento de tokens TypeScript estándar",
      "Interfaz gráfica intuitiva con visualización en tiempo real",
      "Código modular y extensible para otros lenguajes",
      "Suite de pruebas con 95% de cobertura"
    ],
    "projectType": "Personal - Académico",
    "githubUrl": "https://github.com/Twolifelaw/TLF_proyecto.git"
  }
]